<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,736,992" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Constant_30" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4" offset="0" size="16" />
			<output>
				<port id="0" precision="FP32" names="/Constant_30_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_17_output_0" />
			</output>
		</layer>
		<layer id="3" name="Constant_42754" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="24" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_42756" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_42758" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="36" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_20989" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_2290" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="48" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2290">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/backbone/init_block/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>992</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_178" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3504" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/init_block/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/init_block/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/backbone/init_block/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/init_block/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_2293" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="3632" size="4096" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2293">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/stage1/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_198" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7728" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/stage1/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/stage1/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_213" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7856" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/stage1/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_265" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="9008" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/stage1/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/stage1/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_2299" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="9136" size="2048" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2299">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/stage1/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_285" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11184" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/backbone/stage1/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Conv_2302" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="11248" size="6144" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2302">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/stage2/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_301" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17392" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone/stage2/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/stage2/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_316" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="17776" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/backbone/stage2/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>368</dim>
					<dim>496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_368" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="21232" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/stage2/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/stage2/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_2308" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="21616" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2308">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/stage2/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_388" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="30832" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/stage2/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Conv_2311" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="30928" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2311">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/stage2/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_404" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="44752" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/stage2/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/stage2/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_419" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="45328" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone/stage2/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_471" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="50512" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/stage2/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/stage2/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_2317" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="51088" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2317">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/stage2/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_491" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="64912" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/stage2/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/backbone/stage2/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/Add_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="onnx::Conv_2320" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="65008" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2320">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/stage3/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_508" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="78832" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/stage3/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/stage3/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_523" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="79408" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/stage3/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>184</dim>
					<dim>248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_575" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="84592" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/stage3/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/stage3/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::Conv_2326" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="85168" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2326">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage3/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_595" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="103600" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/stage3/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_2329" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="103728" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2329">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/stage3/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_611" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="128304" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/stage3/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/stage3/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit2/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_626" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129072" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/stage3/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_678" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="135984" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/stage3/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/stage3/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit2/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_2335" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="136752" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2335">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/stage3/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_698" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="161328" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage3/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/stage3/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/Add_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_2338" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="161456" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2338">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/stage3/unit3/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_715" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="186032" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage3/unit3/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/stage3/unit3/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit3/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_730" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="186800" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/stage3/unit3/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_782" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="193712" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/stage3/unit3/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/stage3/unit3/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit3/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="onnx::Conv_2344" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="194480" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2344">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/stage3/unit3/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_802" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="219056" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/stage3/unit3/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/backbone/stage3/unit3/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/Add_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="neck.lateral_convs.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="219184" size="8192" />
			<output>
				<port id="0" precision="FP32" names="neck.lateral_convs.0.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/neck/lateral_convs.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_1959" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="227376" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/neck/lateral_convs.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neck/lateral_convs.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="onnx::Conv_2347" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="227632" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2347">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/stage4/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>92</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_819" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="252208" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/backbone/stage4/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
